imagenet_tag_map = {
    'baseball': ['棒球', '棒球手', '棒球帽'],
    'computer keyboard': ['电脑键盘', '键盘'],
    'container': ['集装箱', '集装箱船', '运货车厢'],
    'engine': ['引擎', '发动机', '汽车', '蒸汽机车', '跑车', '赛车'],
    'helicopter': ['直升飞机', '直升机', '飞机'],
    'microphone': ['麦克风', '话筒'],
    'musical instrument': ['钢琴', '立式钢琴', '三角钢琴', '管风琴', '手风琴', '琵琶', '吉他', '鼓', '电吉他', '短号', '长号', '口琴', '西洋琴', '小提琴',
                           '班卓琴', '竖琴', '笛子', '排箫'],
    'remote control': ['遥控器'],
    'toilet': ['厕所', '马桶', '便器', '便池', '便坑', '马桶座'],
    'weapon': ['枪', '炮', '舰', '机', '武器', '步枪', '手枪', '冲锋枪', '坦克', '驱逐舰', '战斗机', '装甲车', '刀', '剑', '大炮', '狙击步枪', '导弹',
               '子弹', '火箭筒', '自动步枪']
}


